#pragma once
#include "MapleClientCollectionTypes/ZXString.h"	//also using AutoTypes.h to store unused portions of code since it's a smol file
#include "MapleClientCollectionTypes/ZRef.h"
#include "MapleClientCollectionTypes/ZArray.h"
#include "MapleClientCollectionTypes/ZList.h"
#include "MapleClientCollectionTypes/TSecType.h"
#include "MapleClientCollectionTypes/ZFatalSection.h"
#include "MapleClientCollectionTypes/winhook_types.h"
#include "winsock2.h"
#include "timeapi.h"
#include "comdef.h"

#pragma region Ezorsia Prepackaged

template <typename TType> TType ReadValue(DWORD dwAddr) { return *((TType*)dwAddr); }
struct _bstr_t__Data_t
{
	wchar_t* m_wstr;
	char* m_str;
	unsigned int m_RefCount;
};
struct _bstr_t2 { _bstr_t__Data_t* m_Data; };

//struct ZFatalSection { ZFatalSectionData FatalData; }; //size 8
struct ZInetAddr { sockaddr_in my_IP_wrapper; };	//10 bytes
//struct _WSABUF { unsigned int len; char* buf; };
__declspec(align(4))struct ZSocketBuffer : ZRefCounted, _WSABUF, ZRefCountedAccessorBase { ZRef<ZSocketBuffer> _m_pParent; };//__unaligned __declspec
struct ZSocketBase { SOCKET _m_hSocket; };
struct ZException { HRESULT m_hr; };
struct _variant_t2 : tagVARIANT { };
//section start: ty to bubbling/Bia10 for the definitions/classes in this section; their release is at https://github.com/MapleDevelopers/MaplestoryV95.1
struct Ztl_variant_t : _variant_t2 { };
struct Ztl_bstr_t : _bstr_t2 { };
class ZSyncAutoUnlock
{
public:
	ZSyncAutoUnlock(ZFatalSection* lock) : m_pLock(lock)
	{
	}

	~ZSyncAutoUnlock()
	{
		if (m_pLock)
		{
			if (--m_pLock->_m_nRef == 1)
			{
				m_pLock->_m_pTIB = 0;
			}
		}
	}
private:
	ZFatalSection* m_pLock;
};
//end of section from bubbling's release

struct CInPacket	////size 24
{
	int m_bLoopback;	//size 4
	int m_nState;	//size 4
	ZArray<unsigned char> m_aRecvBuff;	//size 1 //pad3
	unsigned __int16 m_uLength;	//size 2
	unsigned __int16 m_uRawSeq;	//size 2
	unsigned __int16 m_uDataLen;	//size 2 //pad2
	unsigned int m_uOffset;	//size 4
};
struct ISMSG //size 12
{
	unsigned int message; //0
	unsigned int wParam; //4
	int lParam; //8
};
struct IUnknownVtbl { //size 12
	HRESULT(__stdcall* QueryInterface)(IUnknown* pThis, _GUID*, void**);
	unsigned int(__stdcall* AddRef)(IUnknown* pThis);
	unsigned int(__stdcall* Release)(IUnknown* pThis);
	//void* QueryInterface;
	//void* AddRef;
	//void* Release;
};
struct ILUnknown { IUnknownVtbl* vfptr; }; //size 4
struct IWzGr2D : ILUnknown { }; //size 4
struct _com_ptr_t_com_IIID_IWzGr2D { IWzGr2D* m_pInterface; };
struct _TypeDescriptor2
{
	const void* pVFTable;
	void* spare;
	char name[];
};
struct _PMD2
{
	int mdisp;
	int pdisp;
	int vdisp;
};
struct _s__CatchableType2
{
	unsigned int properties;
	_TypeDescriptor2* pType;
	_PMD2 thisDisplacement;
	int sizeOrOffset;
	void(__cdecl* copyFunction)();
};
struct _s__CatchableTypeArray2
{
	int nCatchableTypes;
	_s__CatchableType2* arrayOfCatchableTypes[];
};
struct _s__ThrowInfo2
{
	unsigned int attributes;
	void(__cdecl* pmfnUnwind)();
	int (*pForwardCompat)(...);
	_s__CatchableTypeArray2* pCatchableTypeArray;
};
struct CMSException : ZException {};
struct CPatchException__PATCHINFO
{
	unsigned __int16 nCurrentVersion;
	unsigned __int16 nTargetVersion;
	char sReserved[768];
	char sCommandLine[256];
	char sRootPath[256];
};
struct CPatchException : CMSException
{
	CPatchException__PATCHINFO m_pi;
};
struct CRTTI { CRTTI* m_pPrev; };
struct __declspec(align(1)) FUNCKEY_MAPPED { char nType; int nID; };
struct IWzSerialize : ILUnknown { };
struct IWzShape2D : IWzSerialize { };
struct IWzVector2D : IWzShape2D { };
struct IWzGr2DLayer : IWzVector2D { };
struct _com_ptr_t_IWzGr2DLayer_GUID_6dc8c7ce_8e81_4420_b4f6_4b60b7d5fcdf { IWzGr2DLayer* m_pInterface; };
struct __declspec(align(4)) IDraggable : ZRefCounted
{
	_com_ptr_t_IWzGr2DLayer_GUID_6dc8c7ce_8e81_4420_b4f6_4b60b7d5fcdf m_pLayer;
	FUNCKEY_MAPPED m_OldIcon;
};
struct INetMsgHandler { void* vfptr; }; //INetMsgHandlerVtbl*
struct INetMsgHandlerVtbl { void(__thiscall* OnPacket)(INetMsgHandler* pThis, int, CInPacket*); };
struct IUIMsgHandler { void* vfptr; }; //IUIMsgHandlerVtbl*
struct IUIMsgHandlerVtbl
{
	void(__thiscall* OnKey)(IUIMsgHandler* pThis, unsigned int, unsigned int);
	BYTE gap4[8];
	int(__thiscall* OnMouseMove)(IUIMsgHandler* pThis, int, int);
	int(__thiscall* OnMouseWheel)(IUIMsgHandler* pThis, int, int, int);
	void(__thiscall* OnMouseEnter)(IUIMsgHandler* pThis, int);
	void(__thiscall* OnDraggableMove)(IUIMsgHandler* pThis, int, IDraggable*, int, int);
	void(__thiscall* SetEnable)(IUIMsgHandler* pThis, int);
	int(__thiscall* IsEnabled)(IUIMsgHandler* pThis);
	void(__thiscall* SetShow)(IUIMsgHandler* pThis, int);
	int(__thiscall* IsShown)(IUIMsgHandler* pThis);
	int(__thiscall* GetAbsLeft)(IUIMsgHandler* pThis);
	int(__thiscall* GetAbsTop)(IUIMsgHandler* pThis);
	void(__thiscall* ClearToolTip)(IUIMsgHandler* pThis);
	void(__thiscall* OnIMEModeChange)(IUIMsgHandler* pThis, char);
	void(__thiscall* OnIMEResult)(IUIMsgHandler* pThis, const char*);
	void(__thiscall* OnIMEComp)(IUIMsgHandler* pThis, const char*, ZArray<unsigned long>*, unsigned int, int, ZList<ZXString<char> >*, int, int, int);
	CRTTI* (__thiscall* GetRTTI)(IUIMsgHandler* pThis);
	int(__thiscall* IsKindOf)(IUIMsgHandler* pThis, CRTTI*);
};
struct IGObj { void* vfptr; }; //IGObjVtbl*
struct IGObjVtbl { void(__thiscall* Update)(IGObj* pThis); };
struct CStage : IGObj, IUIMsgHandler, INetMsgHandler, ZRefCounted { }; //#3072
struct CClientSocket_CONNECTCONTEXT { ZList<ZInetAddr> my_IP_Addresses; void* posList; int bLogin; }; //size 28 //4 bytes dd for voids //__POSITION*
//struct CClientSocketVtbl { void*(__thiscall* __vecDelDtor)(CClientSocket* pThis, unsigned int); }; //clientsocket definition error? switching to void
struct CClientSocket {	//singleton		//size 148
	void* vfptr;//00000000 vfptr dd ? ; offset //size 4
	HWND__* m_hWnd;//00000004 m_hWnd dd ? ; offset		//size 4
	ZSocketBase m_sock;//00000008 m_sock ZSocketBase ?	//size 4
	CClientSocket_CONNECTCONTEXT m_ctxConnect;	//0000000C m_ctxConnect CClientSocket::CONNECTCONTEXT ? //size 28
	ZInetAddr m_addr;	//00000028 m_addr ZInetAddr ?	//size 16 //4 ints, for IP address
	DWORD m_tTimeout;//00000038 m_tTimeout dd ?	//size 4
	ZList<ZRef<ZSocketBuffer>> m_lpRecvBuff;//0000003C m_lpRecvBuff ZList<ZRef<ZSocketBuffer> > ? //size 20
	ZList<ZRef<ZSocketBuffer>> m_lpSendBuff;//00000050 m_lpSendBuff ZList<ZRef<ZSocketBuffer> > ? //size 20
	CInPacket m_packetRecv;//00000064 m_packetRecv CInPacket ? //size 24
	ZFatalSection m_lockSend;//0000007C m_lockSend ZFatalSection ? //size 8
	unsigned int m_uSeqSnd;//00000084 m_uSeqSnd dd ?	//size 4
	unsigned int m_uSeqRcv;//00000088 m_uSeqRcv dd ?	//size 4
	ZXString<char> m_URLGuestIDRegistration;	//0000008C m_URLGuestIDRegistration ZXString<char> ? //size 4
	int m_bIsGuestID;//00000090 m_bIsGuestID dd ?	//size 4
};//1713	CClientSocket	00000094	Auto	struct __cppobj : TSingleton<CClientSocket> {CClientSocketVtbl *vfptr;HWND__ *m_hWnd;
struct CUIStatusBar {
	struct CChatLog : ZRefCounted {
		ZXString<unsigned short> m_sChat;
		int _ZtlSecureTear_m_nType[2];
		unsigned int _ZtlSecureTear_m_nType_CS;
		int m_nBack;
		int m_nChannelID;
		int m_bWhisperIcon;
		int m_bFirstLine;
		ZRef<void>* m_pItem;//ZRef<GW_ItemSlotBase> m_pItem;
	};
};	//fix this //fixed?try?
struct CWvsApp { //singleton
	void* vfptr; //0
	HWND__* m_hWnd; //4
	int m_bPCOMInitialized; //8
	unsigned int m_dwMainThreadId; //12
	HHOOK__* m_hHook; //16
	int m_bWin9x; //20
	int m_tUpdateTime; //44
	int m_bFirstUpdate; //48
	ZXString<char> m_sCmdLine; //52
	int m_nGameStartMode; //56
	int m_bAutoConnect; //60
	int m_bShowAdBalloon; //64
	int m_bExitByTitleEscape; //68
	HRESULT m_hrZExceptionCode; //72
	HRESULT m_hrComErrorCode; //76
	unsigned int m_dwSecurityErrorCode; //80
	int m_nTargetVersion; //84
	int m_tLastServerIPCheck; //88
	int m_tLastServerIPCheck2; //92
	int m_tLastGGHookingAPICheck; //96
	int m_tLastSecurityCheck; //100
	void* m_ahInput[3]; //size 12 //104 //84
	int m_tNextSecurityCheck; //116 //96
	bool m_bEnabledDX9; //size 1, pad 3 //120 //100
	ZArray<unsigned char> m_pBackupBuffer; //124 //104
	unsigned int m_dwBackupBufferSize; //128 //108
	unsigned int m_dwClearStackLog; //132 //112
	int m_bWindowActive; //136 //116
};

DWORD GetFuncAddress(LPCSTR lpModule, LPCSTR lpFunc) {	//utility function also found in mapleclient template
	HMODULE mod = LoadLibraryA(lpModule); //ty alias! for sharing their version	//ps i made some changes
	if (!mod)
	{
		std::cout << "GetFuncAddress failed at " << lpModule << std::endl;
		return 0;
	}
	DWORD address = (DWORD)GetProcAddress(mod, lpFunc);
	if (!address)
	{
		std::cout << "GetFuncAddress failed at " << lpFunc << std::endl;
		return 0;
	}
	return address;
}

//sub_9DE438    end 009DE7F8	//returns int but if hooking to run and run other stuff after, dont actually return
